Repository: ESUCC/Maximd
Catalog: application/translation/form004/page4.tmx
Source language: es
Languages: en

source: Cada objetivo deberá propiciar que el niño se involucre en su programa general de estudios y deberá cubrir cada una de las otras necesidades del niño. Según corresponda a los niños de educación preescolar, cada objetivo o punto de referencia deberán estar relacionados para permitir que el niño participe en actividades apropiadas.
en: Each goal should be related to enabling the child to be involved in or progress in the general curriculum, and should be related to meeting each of the child's other needs. As appropriate, for preschool children, each objective or benchmark should be related to enabling the child to participate in appropriate activities

source: Objetivos medibles anuales (Incluyendo objetivos funcionales y académicos)
en: Measurable Annual Goals (Including Academic and Functional Goals)

source: Auxiliar de objetivos
en: Goal Helper

source: SPANISH:Se deberá utilizar una página adicional para cada objetivo y los objetivos de los servicios de transición pueden registrarse en esta página
en: An additional page should be used for each goal, and goals for transition services can be recorded on this page

source: ¿El niño tendrá que realizar evaluaciones alternas?
en: Will the child be taking alternate assessments?

source: NOTA: Esta sección se requiere sólo en caso de que el estudiante esté realizando evaluaciones alternas
en: NOTE: This section is only required if the student is taking alternate assessments

source: Informe de progreso
en: Progress Report

source: Horario
en: Schedule

source: Restituir las fechas del horario
en: Restore dates from schedule

source: Procedimientos de evaluación
en: Evaluation Procedures

source: Persona responsable
en: Person Responsible

source: Por favor ingrese las fechas de revisión programadas, las fechas en que realmente se llevaron acabo las revisiones y los logros serán registrados como parte del informe de progreso
en: Please enter scheduled review dates, actual review dates and achievements will be recorded as part of the progress report

source: Fecha
en: Date

source: Se les hará llegar a los padres un informe sobre cómo progresan los alumnos: (por ejemplo, informes de progreso, cartas, llamadas telefónicas, etc.)
en: Statement of how student's progress will be reported to parents: (i.e., progress reports, letters, phone calls, etc.)

source: Evaluaciones alternas:
en: Alternate Assessments:

source: Sí
en: Yes

source: Objetivos o puntos de referencia a corto plazo
en: Short-Term Objectives or Benchmarks

source: Si otro, por favor especifique:
en: If other, please specify:

source: Observaciones del profesor
en: Teacher Observation

source: Rendimiento de escritura
en: Written Performance

source: Rendimiento oral
en: Oral Performance

source: Prueba de criterio establecido
en: Criterion Reference Test

source: Informe de los padres
en: Parent Report

source: Muestra de tiempo
en: Time Sample

source: Boletas de calificaciones
en: Report Cards

source: Padre/Madre
en: Parent

source: Profesor de la clase
en: Classroom Teacher

source: Profesor de educación especial (SPED)
en: SPED Teacher

source: Patólogo del habla y lenguaje
en: Speech-Language Pathologist

source: Especialista en sordera o problemas de audición
en: Deaf/Hard of Hearing Specialist

source: Especialista de preescolares
en: Early Childhood Specialist

source: Terapeuta ocupacional
en: Occupational Therapist

source: Terapeuta físico
en: Physical Therapist

source: Audiólogo
en: Audiologist

source: Otro
en: Other

source: Otro procedimiento de evaluación:
en: Evaluation Procedure Other:

source: Otra persona responsable:
en: Person Responsible Other:

source: Objetivos medibles anuales :
en: Measurable Annual Goals:

source: Objetivos a corto plazo:
en: Short Term Objectives:

source: Fecha de progreso 1:
en: Progress Date 1:

source: Fecha de progreso 2:
en: Progress Date 1:

source: Fecha de progreso 3:
en: Progress Date 1:

source: Fecha de progreso 4:
en: Progress Date 1:

source: Fecha de progreso 5:
en: Progress Date 1:

source: Fecha de progreso 6:
en: Progress Date 1:

source: Informe de progreso:
en: Statement of progress:

source: Objetivo
en: Goal

source: Seleccionar y guardar para eliminar la pestaña:
en: Check and save to remove tab:

source: Agregar objetivo
en: Add Goal

source: Objetivo medible anual:
en: Measurable Annual Goal

source: INFORME DE PROGRESO
en: PROGRESS REPORT

source: Procedimientos/Instrumentos de evaluación
en: Evaluation Procedures/Instruments

source: Persona(s) responsable(s)
en: Person(s) Responsible

source: Fechas de revisión
en: Review Dates

source: Objetivos
en: Goals
